<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"staging","backend":"e2178fd7269c6b833f7c5fdd22116f3ec84fdb85696c2587ec19a1ddbc01d0a3","plan_job_ref":"Job Pull Request Checks #367 at https://github.com/GSA-TTS/FAC/actions/runs/21778721347","plan_out_hash":"ade5b84290c8875ce87b5f40da8c3ea689be4aaf1eb3464586810cf319a74f19","plan_hash":"9f490af4f0cfef47582bf9560175236bc2592e4ce09eeccfeb9873208543cd3a","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 8 to add, 4 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.staging.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2026-02-06T11:01:27Z" -> (known after apply)
        }
    }

  # module.staging.module.newrelic.newrelic_alert_policy.main will be updated in-place
!~  resource "newrelic_alert_policy" "main" {
        id                  = "4901948"
!~      incident_preference = "PER_POLICY" -> "PER_CONDITION"
        name                = "Staging Alerts"
#        (1 unchanged attribute hidden)
    }

  # module.staging.module.newrelic.newrelic_nrql_alert_condition.db_slow_queries will be created
+   resource "newrelic_nrql_alert_condition" "db_slow_queries" {
+       account_id                   = (known after apply)
+       aggregation_window           = (known after apply)
+       enabled                      = false
+       entity_guid                  = (known after apply)
+       id                           = (known after apply)
+       name                         = "Production DB Statement Duration"
+       policy_id                    = 4901948
+       type                         = "static"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       critical {
+           disable_health_status_reporting = false
+           operator                        = "above"
+           threshold                       = 150
+           threshold_duration              = 120
+           threshold_occurrences           = "all"
        }

+       nrql {
+           data_account_id = (known after apply)
+           query           = "SELECT average(`duration.ms`) FROM Span FACET `db.statement` WHERE entity.name ='gsa-fac-staging'"
        }
    }

  # module.staging.module.newrelic.newrelic_nrql_alert_condition.error_rate will be updated in-place
!~  resource "newrelic_nrql_alert_condition" "error_rate" {
        id                             = "4901948:37685323"
        name                           = "gsa-fac-staging - Error rate"
#        (21 unchanged attributes hidden)

!~      critical {
!~          threshold                       = 3 -> 10
#            (6 unchanged attributes hidden)
        }

#        (1 unchanged block hidden)
    }

  # module.staging.module.newrelic.newrelic_nrql_alert_condition.http_500_errors will be created
+   resource "newrelic_nrql_alert_condition" "http_500_errors" {
+       account_id                   = (known after apply)
+       aggregation_window           = (known after apply)
+       enabled                      = true
+       entity_guid                  = (known after apply)
+       id                           = (known after apply)
+       name                         = "Production Request Received a 500 Status"
+       policy_id                    = 4901948
+       type                         = "static"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       critical {
+           disable_health_status_reporting = false
+           operator                        = "above"
+           threshold                       = 0
+           threshold_duration              = 60
+           threshold_occurrences           = "all"
        }

+       nrql {
+           data_account_id = (known after apply)
+           query           = "SELECT count(*) FROM Transaction FACET `request.uri` WHERE response.status = '500' and appName = 'gsa-fac-staging'"
        }
    }

  # module.staging.module.newrelic.newrelic_nrql_alert_condition.infected_file will be created
+   resource "newrelic_nrql_alert_condition" "infected_file" {
+       account_id                   = (known after apply)
+       aggregation_window           = (known after apply)
+       enabled                      = true
+       entity_guid                  = (known after apply)
+       fill_option                  = "static"
+       fill_value                   = 0
+       id                           = (known after apply)
+       name                         = "Infected File Found!"
+       policy_id                    = 4901948
+       type                         = "static"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       critical {
+           disable_health_status_reporting = false
+           operator                        = "above_or_equals"
+           threshold                       = 1
+           threshold_duration              = 300
+           threshold_occurrences           = "at_least_once"
        }

+       nrql {
+           data_account_id = (known after apply)
+           query           = "SELECT count(*) FROM Log WHERE tags.space_name ='staging' and message LIKE '%ScanResult.INFECTED%'"
        }
    }

  # module.staging.module.newrelic.newrelic_nrql_alert_condition.long_running_web_fn will be created
+   resource "newrelic_nrql_alert_condition" "long_running_web_fn" {
+       account_id                   = (known after apply)
+       aggregation_window           = (known after apply)
+       enabled                      = false
+       entity_guid                  = (known after apply)
+       id                           = (known after apply)
+       name                         = "Long Running Web Function ( > 200ms)"
+       policy_id                    = 4901948
+       type                         = "static"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       critical {
+           disable_health_status_reporting = false
+           operator                        = "above"
+           threshold                       = 20
+           threshold_duration              = 60
+           threshold_occurrences           = "at_least_once"
        }

+       nrql {
+           data_account_id = (known after apply)
+           query           = "SELECT count(*) FROM Transaction  WHERE appName = 'gsa-fac-staging' EXTRAPOLATE FACET name where name not like 'WebTransaction/Function/api.views:Sprite.get'"
        }
    }

  # module.staging.module.newrelic.newrelic_nrql_alert_condition.response_time will be updated in-place
!~  resource "newrelic_nrql_alert_condition" "response_time" {
!~      enabled                        = true -> false
        id                             = "4901948:37685322"
        name                           = "gsa-fac-staging - Response time (ms)"
#        (20 unchanged attributes hidden)

-       critical {
-           disable_health_status_reporting = false -> null
-           duration                        = 0 -> null
-           operator                        = "above" -> null
-           threshold                       = 3 -> null
-           threshold_duration              = 300 -> null
-           threshold_occurrences           = "all" -> null
#            (1 unchanged attribute hidden)
        }

+       warning {
+           disable_health_status_reporting = false
+           operator                        = "above"
+           threshold                       = 3
+           threshold_duration              = 300
+           threshold_occurrences           = "all"
        }

#        (1 unchanged block hidden)
    }

  # module.staging.module.newrelic.newrelic_nrql_alert_condition.slow_transactions will be created
+   resource "newrelic_nrql_alert_condition" "slow_transactions" {
+       account_id                   = (known after apply)
+       aggregation_window           = (known after apply)
+       enabled                      = false
+       entity_guid                  = (known after apply)
+       id                           = (known after apply)
+       name                         = "Slow Transactions"
+       policy_id                    = 4901948
+       type                         = "static"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       nrql {
+           data_account_id = (known after apply)
+           query           = "SELECT count(*) from Transaction where appName = 'gsa-fac-staging' facet name"
        }

+       warning {
+           disable_health_status_reporting = false
+           operator                        = "above"
+           threshold                       = 15
+           threshold_duration              = 300
+           threshold_occurrences           = "all"
        }
    }

  # module.staging.module.newrelic.newrelic_nrql_alert_condition.synth_uptime_check will be created
+   resource "newrelic_nrql_alert_condition" "synth_uptime_check" {
+       account_id                   = (known after apply)
+       aggregation_window           = (known after apply)
+       enabled                      = true
+       entity_guid                  = (known after apply)
+       id                           = (known after apply)
+       name                         = "Ping of app.fac.gov failed"
+       policy_id                    = 4901948
+       type                         = "static"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       critical {
+           disable_health_status_reporting = false
+           operator                        = "above"
+           threshold                       = 1
+           threshold_duration              = 300
+           threshold_occurrences           = "all"
        }

+       nrql {
+           data_account_id = (known after apply)
+           query           = "SELECT filter(count(*), WHERE result = 'FAILED') AS 'Failures' FROM SyntheticCheck WHERE entityGuid IN ('MzkxOTA3NnxTWU5USHxNT05JVE9SfDRkZDk0NWI1LTAyMTQtNDY1NS04MWM2LTdmZTBhM2MzNDBkOQ') FACET monitorName"
        }
    }

  # module.staging.module.newrelic.newrelic_nrql_alert_condition.throughput will be updated in-place
!~  resource "newrelic_nrql_alert_condition" "throughput" {
!~      enabled                        = true -> false
        id                             = "4901948:37685324"
        name                           = "gsa-fac-staging - Throughput"
#        (20 unchanged attributes hidden)

-       critical {
-           disable_health_status_reporting = false -> null
-           duration                        = 0 -> null
-           operator                        = "above" -> null
-           threshold                       = 3 -> null
-           threshold_duration              = 300 -> null
-           threshold_occurrences           = "all" -> null
#            (1 unchanged attribute hidden)
        }

+       warning {
+           disable_health_status_reporting = false
+           operator                        = "above"
+           threshold                       = 3
+           threshold_duration              = 300
+           threshold_occurrences           = "all"
        }

#        (1 unchanged block hidden)
    }

  # module.staging.module.newrelic.newrelic_nrql_alert_condition.transaction_error will be created
+   resource "newrelic_nrql_alert_condition" "transaction_error" {
+       account_id                   = (known after apply)
+       aggregation_window           = (known after apply)
+       enabled                      = true
+       entity_guid                  = (known after apply)
+       id                           = (known after apply)
+       name                         = "Transaction Error Occured"
+       policy_id                    = 4901948
+       type                         = "static"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       critical {
+           disable_health_status_reporting = false
+           operator                        = "above_or_equals"
+           threshold                       = 1
+           threshold_duration              = 60
+           threshold_occurrences           = "at_least_once"
        }

+       nrql {
+           data_account_id = (known after apply)
+           query           = "select count(*) from TransactionError where (error.message != 'bad role' and appName = 'gsa-fac-staging') FACET error.message, request.uri, error.class "
        }
    }

Plan: 8 to add, 4 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #367](https://github.com/GSA-TTS/FAC/actions/runs/21778721347)